Revit 2024 API
BoundingBoxIntersectsFilter Constructor (Outline, Boolean)
 Constructs a new instance of a filter to match elements with a bounding box that intersects the given Outline, with the option to invert the filter and match all elements with a bounding box that are not intersecting the given Outline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public BoundingBoxIntersectsFilter(
	Outline outline,
	bool inverted
)
Visual Basic
Public Sub New ( _
	outline As Outline, _
	inverted As Boolean _
)
Visual C++
public:
BoundingBoxIntersectsFilter(
	Outline^ outline,
	bool inverted
)
Parameters
outline
Type: Autodesk.Revit.DB.Outline
 The Outline used to find elements with a bounding box that intersect it.
inverted
Type: System.Boolean
 True if the filter should be inverted and match all elements with a bounding box that are not intersecting the given Outline.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  outline is an empty Outline.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
BoundingBoxIntersectsFilter Class
BoundingBoxIntersectsFilter Overload
Autodesk.Revit.DB Namespace